<a href="https://colab.research.google.com/github/ishitavasishth/RealtimeDataSQL/blob/main/SQLData_IshitaVasishth.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Connecting

Execute this next cell, and enter your class name (all lower case) followed by the Enter key.  Your class name is one of

1. `mkt178`
1. `mkt182`
1. `mkt188`

In [ ]:
cls = input("class name:")

class name:mkt182

Then run this next cell, which will prompt you for your user name, which is your UT EID (all lower case).

In [ ]:
user = input("user name:")

user name:iv3848

Run this next cell just to load a utility package (that is supposed to be good for prompting for a password).

In [ ]:
import getpass

Your password is your grade (a four-digit number without the comma) on the fake assignment in Canvas followed by `tacos`.

For example, if your grade is `1234`, then your password is `1235tacos`.

Run this next cell to provide your password.

In [ ]:
password = getpass.getpass()

··········

Now attempt to run the next three cells. If you don't get any errors, go celebrate and come back here later. If you do get an error, you might want to post a screenshot in Slack and seek some advice.

In [ ]:
!pip install PyMySQL -q

   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 1.7 MB/s eta 0:00:00

In [ ]:
%load_ext sql

In [ ]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
hostname = f"{cls}.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com"

In [ ]:
%sql mysql+pymysql://{user}:{password}@{hostname}/shared

# Homework tooling

## Homework table

In [ ]:
%sql USE {user}db

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
0 rows affected.

[]

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS homework (
  assignment INTEGER,
  problem INTEGER,
  answer TEXT,
  PRIMARY KEY homework_pk (assignment,problem)
)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
0 rows affected.

[]

## Homework tools

In [ ]:
def eval_query(cell_index=-2):
  return eval(In[cell_index]).DataFrame().to_json()

In [ ]:
def get_answer(assignment,problem):
  rs = %sql SELECT answer FROM shared.homework WHERE assignment = :assignment AND problem = :problem
  return rs[0][0]

In [ ]:
def set_answer(assignment,problem,cell_index=-2,check=True):
  guess = eval_query(cell_index)
  print('guess: ' + guess)
  %sql INSERT INTO shared.homework VALUES (:assignment,:problem,:guess) ON DUPLICATE KEY UPDATE answer = :guess

In [ ]:
def store_answer(assignment,problem,cell_index=-2,check=True):
  guess = eval_query(cell_index)
  print('guess: ' + guess)
  if check:
    answer = get_answer(assignment,problem)
    print('answer: ' + answer)
    if guess != answer:
      print("wrong answer")
      return
  %sql INSERT INTO {user}db.homework VALUES (:assignment,:problem,:guess) ON DUPLICATE KEY UPDATE answer = :guess

In [ ]:
def grade(assignment):
  rs = %sql SELECT COUNT(*) AS n FROM shared.homework AS shared LEFT JOIN {user}db.homework AS mine ON shared.assignment = mine.assignment AND shared.problem = mine.problem WHERE shared.answer = mine.answer AND shared.assignment = :assignment
  correct = rs[0][0]
  print(f'correct: {correct}')
  rs = %sql SELECT COUNT(*) AS n FROM shared.homework AS shared WHERE shared.assignment = :assignment
  total = rs[0][0]
  print(f'total: {total}')
  return correct/total

This pretend assignment is number 0.

# Assignment 3

## Introduction

This assignment uses some ouf our newly generated data, which is available in the schema `shared`.

_You do not need to generate any data yourself._ Just use the tables in `shared`.

This Canvas [assignment](https://utexas.instructure.com/courses/1386298/assignments/6660850) has a diagram for our tables.

In [ ]:
%sql USE shared

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
0 rows affected.

[]

In [ ]:
%sql SHOW TABLES

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
12 rows affected.

[('baskets',),
 ('bikeshare',),
 ('customers',),
 ('genders',),
 ('homework',),
 ('products',),
 ('purchases',),
 ('state_census',),
 ('states',),
 ('states_2013',),
 ('survey',),
 ('test',)]

In [ ]:
%sql SHOW COLUMNS FROM customers

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
5 rows affected.

[('cid', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('first_name', 'varchar(32)', 'YES', '', None, ''),
 ('last_name', 'varchar(32)', 'YES', '', None, ''),
 ('state', 'char(2)', 'YES', 'MUL', None, ''),
 ('gender', 'char(1)', 'YES', 'MUL', None, '')]

In [ ]:
%sql SELECT * FROM customers LIMIT 3

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
3 rows affected.

[(1, 'Unpredisposing', 'Damnous', 'MA', None),
 (3, 'Inlayer', 'Anaschistic', 'CA', None),
 (4, 'Sycophantic', 'Mastful', 'KY', None)]

You should look around the other tables: `states`, `baskets`, `purchases`, and `products` in particular.

A record in the `baskets` table stores a basket's check-out time (column `t`) and the id (column `cid`) of the customer that had that basket.  The actual items in the basket are in the `purchases` table.

Let's look at basket with id 3 as an example:

In [ ]:
%sql SELECT * FROM baskets WHERE id = 3

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

[(3, datetime.datetime(2011, 6, 9, 0, 0), 13)]

You can see the basket's customer id in the `cid` column.

To find what was actually in the basket, we look in the `purchases` table:

In [ ]:
%sql SELECT * FROM purchases WHERE basket = 3

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
3 rows affected.

[(6, 3, 6, 2), (7, 3, 457, 2), (8, 3, 350, 2)]

For a fancier example, we could see information about the albums in the basket like this:

In [ ]:
%%sql
SELECT *
  FROM purchases
  LEFT JOIN products ON purchases.sku = products.sku
  WHERE basket = 3

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
3 rows affected.

[(6, 3, 6, 2, 6, 7, 1972, 'Exile on Main St.', 'The Rolling Stones', 'Rock', 'Blues Rock, Rock & Roll, Classic Rock', 'Rock'),
 (7, 3, 457, 2, 457, 458, 1970, 'Tumbleweed Connection', 'Elton John', 'Rock, Folk, World, & Country', 'Soft Rock, Country Rock', 'Rock'),
 (8, 3, 350, 2, 350, 351, 1979, 'Rust Never Sleeps', 'Neil Young & Crazy Horse', 'Rock', 'Hard Rock, Arena Rock', 'Rock')]

## Note

**Important**: A few of these questions are "top _n_" questions. However, the point here isn't to fret about possible ties. To deal with possible ties simply, the questions ask for a secondary `SORT BY` expression (just a column).

## Problem 1

What top three states have the most customers?

Your result should have two columns: `state` and `customer_count`. The result should have three rows in descending order of `customer_count` (with `state` `ASC` breaking any ties).

Hint: You do not need to do a join.

In [ ]:
%%sql
select state, count(*) as customer_count
from customers
group by state
order by customer_count desc, state asc
limit 3;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
3 rows affected.

[('CA', 16), ('NY', 10), ('FL', 8)]

In [ ]:
store_answer(3,1)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
3 rows affected.
guess: {"state":{"0":"CA","1":"NY","2":"FL"},"customer_count":{"0":16,"1":10,"2":8}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
answer: {"state":{"0":"CA","1":"NY","2":"FL"},"customer_count":{"0":16,"1":10,"2":8}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

Bonus question (easy and ungraded): Is there a tie for third place? Always watch out for actual ties or close calls for "top n" queries.

## Problem 2

What are top 10 states by basket count?

Remember that a "basket" is a shopping cart that resulted in a sale. So the question could be: What top 10 states represent the most check-outs (and not -- say -- quantity of products or revenue)?

Your result should contain two columns: `state` and `basket_count`, where `basket_count` is the number of baskets sold in that `state`. The result records should be in descending `basket_count` order and secondarily (to break possible ties) by state order (ascending).

Since the `baskets` table doesn't have a `state` column, you need to relate `baskets` to states somehow.

The `baskets` table has a `cid` column.  That column really means "customer id", which is what the `cid` column in the `customers` table means.

We can associate states with baskets like this:

In [ ]:
%%sql
SELECT *
  FROM baskets
  LEFT JOIN customers ON baskets.cid = customers.cid
  LIMIT 10

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
10 rows affected.

[(1, datetime.datetime(2015, 5, 26, 0, 0), 4, 4, 'Sycophantic', 'Mastful', 'KY', None),
 (2, datetime.datetime(2002, 6, 15, 0, 0), 15, 15, 'Construability', 'Chopine', 'CA', 'M'),
 (3, datetime.datetime(2011, 6, 9, 0, 0), 13, 13, 'Homopterous', 'Hyperbatic', 'WV', 'F'),
 (4, datetime.datetime(2015, 6, 28, 0, 0), 11, 11, 'Anticonventional', 'Jacutinga', 'NY', 'M'),
 (5, datetime.datetime(1987, 10, 28, 0, 0), 20, 20, 'Thuluth', 'Bistournage', 'FL', 'M'),
 (6, datetime.datetime(2019, 3, 18, 0, 0), 4, 4, 'Sycophantic', 'Mastful', 'KY', None),
 (7, datetime.datetime(1993, 12, 12, 0, 0), 1, 1, 'Unpredisposing', 'Damnous', 'MA', None),
 (8, datetime.datetime(2022, 1, 1, 0, 0), 10, 10, 'In', 'Vitreodentine', 'TX', 'M'),
 (9, datetime.datetime(2000, 4, 1, 0, 0), 14, 14, 'Unsteadfastness', 'Arsenotherapy', 'MD', 'M'),
 (10, datetime.datetime(2024, 5, 13, 0, 0), 21, 21, 'Wander', 'Progypsy', 'TN', 'F')]

Study line 4 above, and look at the results.

The first columns in the results are from `baskets`, and the rest of the columns are from `customers`.  The `cid_1` column in the result is the `cid` column from `customers` renamed to avoid a duplicate column name in the result.

Can you add `GROUP BY` and `ORDER BY` clauses (and adjust the `LIMIT`) to head towards an answer to the question?

You'll also need to modify the `SELECT` clause to compute and return the right columns of the result set. In particular, you'll probably want to `COUNT` somewhere.

In [ ]:
%%sql
SELECT state, count(*) as basket_count
  FROM baskets
  LEFT JOIN customers ON baskets.cid = customers.cid
  GROUP BY state
  ORDER BY count(*) desc, state asc
  LIMIT 10

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
10 rows affected.

[('CA', 187),
 ('FL', 91),
 ('NY', 75),
 ('TX', 54),
 ('NJ', 53),
 ('NC', 41),
 ('AR', 40),
 ('WA', 36),
 ('WV', 35),
 ('VA', 34)]

In [ ]:
store_answer(3,2)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
10 rows affected.
guess: {"state":{"0":"CA","1":"FL","2":"NY","3":"TX","4":"NJ","5":"NC","6":"AR","7":"WA","8":"WV","9":"VA"},"basket_count":{"0":187,"1":91,"2":75,"3":54,"4":53,"5":41,"6":40,"7":36,"8":35,"9":34}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
answer: {"state":{"0":"CA","1":"FL","2":"NY","3":"TX","4":"NJ","5":"NC","6":"AR","7":"WA","8":"WV","9":"VA"},"basket_count":{"0":187,"1":91,"2":75,"3":54,"4":53,"5":41,"6":40,"7":36,"8":35,"9":34}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

## Problem 3

What are the *eight* most purchased albums? Your result should have two columns: `Album` and `purchases`. That `purchases` should be the number of times the album was purchased, and that count should include multiple purchases of the same album in one basket.  That's the `quantity` in the `purchases` table.  In other words, if a basket contained three "Remain in Light" albums, then all three should be counted (not just one).

The result should have eight rows sorted by descending `purchases` and secondarily by `Album` (in case of ties in `quantity`).

You'll need to do a join to relate `Album` in the `products` table to `quantity` in the `purchases` table.

Let's set up a basic join to get started.

In [ ]:
%%sql
SELECT *
  FROM purchases
  LEFT JOIN products ON purchases.sku = products.sku
  LIMIT 10

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
10 rows affected.

[(1, 1, 64, 1, 64, 65, 1991, 'Back to Mono (1958-1969)', 'Phil Spector', 'Rock, Funk / Soul, Pop', 'Doo Wop, Pop Rock, Ballad, Rhythm & Blues', 'Rock'),
 (2, 1, 149, 2, 149, 150, 1978, 'Darkness on the Edge of Town', 'Bruce Springsteen', 'Rock', 'Pop Rock', 'Rock'),
 (3, 2, 240, 1, 240, 241, 1984, 'Let It Be', 'The Replacements', 'Rock', 'Alternative Rock, Power Pop, Punk, Indie Rock', 'Rock'),
 (4, 2, 393, 2, 393, 394, 1974, 'Good Old Boys', 'Randy Newman', 'Rock, Pop', 'Pop Rock, Vocal', 'Rock'),
 (5, 2, 175, 2, 175, 176, 1976, 'Rocks', 'Aerosmith', 'Rock', 'Hard Rock, Classic Rock', 'Rock'),
 (6, 3, 6, 2, 6, 7, 1972, 'Exile on Main St.', 'The Rolling Stones', 'Rock', 'Blues Rock, Rock & Roll, Classic Rock', 'Rock'),
 (7, 3, 457, 2, 457, 458, 1970, 'Tumbleweed Connection', 'Elton John', 'Rock, Folk, World, & Country', 'Soft Rock, Country Rock', 'Rock'),
 (8, 3, 350, 2, 350, 351, 1979, 'Rust Never Sleeps', 'Neil Young & Crazy Horse', 'Rock', 'Hard Rock, Arena Rock', 'Rock'),
 (9, 4, 191, 1, 191, 192, 1969, 'The Gilded Palace of Sin', 'The Flying Burrito Brothers', 'Rock, Folk, World, & Country', 'Country Rock', 'Rock'),
 (10, 4, 433, 1, 433, 434, 1972, '#1 Record', 'Big Star', 'Rock', 'Power Pop', 'Rock')]

The first four columns are from the `purchases` table, and the rest of the columns are from the `products` table.  (Use `SHOW COLUMS FROM products` to see what columns that table has.) Note that `sku_1` is a generated replacement name for the `sku` column in `products`. We can't have a result set that has two columns of the same name, so the database renames that column for us.

Try to add `GROUP BY` and an `ORDER BY` clauses to head towards the answer.

Remember to edit the `LIMIT` if you need to.

In [ ]:
%%sql
select *
from purchases
limit 2;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
2 rows affected.

[(1, 1, 64, 1), (2, 1, 149, 2)]

In [ ]:
%%sql
select *
from products
limit 2;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
2 rows affected.

[(0, 1, 1967, "Sgt. Pepper's Lonely Hearts Club Band", 'The Beatles', 'Rock', 'Rock & Roll, Psychedelic Rock', 'Rock'),
 (1, 2, 1966, 'Pet Sounds', 'The Beach Boys', 'Rock', 'Pop Rock, Psychedelic Rock', 'Rock')]

In [ ]:
%%sql
SELECT p.album AS Album, SUM(t.total_quantity) AS purchases
FROM (
    SELECT purchases.sku, purchases.basket, SUM(purchases.quantity) AS total_quantity
    FROM purchases
    GROUP BY purchases.sku, purchases.basket
) AS t
JOIN products p
ON t.sku = p.sku
GROUP BY p.album
ORDER BY purchases DESC, p.album ASC
LIMIT 8;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
8 rows affected.

[('Greatest Hits', Decimal('26')),
 ('Let It Be', Decimal('22')),
 ('Tres hombres', Decimal('21')),
 ('Superunknown', Decimal('19')),
 ('40 Greatest Hits', Decimal('18')),
 ('Aladdin Sane', Decimal('18')),
 ("Howlin' Wolf", Decimal('18')),
 ('Sea Change', Decimal('18'))]

In [ ]:
store_answer(3,3)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
8 rows affected.
guess: {"Album":{"0":"Greatest Hits","1":"Let It Be","2":"Tres hombres","3":"Superunknown","4":"40 Greatest Hits","5":"Aladdin Sane","6":"Howlin' Wolf","7":"Sea Change"},"purchases":{"0":26.0,"1":22.0,"2":21.0,"3":19.0,"4":18.0,"5":18.0,"6":18.0,"7":18.0}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
answer: {"Album":{"0":"Greatest Hits","1":"Let It Be","2":"Tres hombres","3":"Superunknown","4":"40 Greatest Hits","5":"Aladdin Sane","6":"Howlin' Wolf","7":"Sea Change"},"purchases":{"0":26.0,"1":22.0,"2":21.0,"3":19.0,"4":18.0,"5":18.0,"6":18.0,"7":18.0}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

Hint: Since we need to consider when a customer buys multiple copies of the same album in one basket, we'll probably need something like `SUM(quantity)` somewhere. That `quantity` goes into the `purchases` column in the `purchases` table.

## Problem 4

Who are the top six selling artists?

You result set should have two columns: `Artist` and `purchases`. The result set should have five rows in descending `purchases` order and secondarily by `Artist` (ascending, to break ties).

You can probably just modify the query for Problem 3. Shouldn't take much work!

In [ ]:
%%sql
SELECT products.artist as Artist, SUM(purchases.quantity) AS purchases
FROM purchases
LEFT JOIN products
ON purchases.sku = products.sku
GROUP BY products.artist
ORDER BY purchases DESC, products.artist asc
LIMIT 6;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
6 rows affected.

[('The Beatles', Decimal('93')),
 ('Bob Dylan', Decimal('79')),
 ('The Rolling Stones', Decimal('64')),
 ('David Bowie', Decimal('56')),
 ('The Who', Decimal('54')),
 ('Bruce Springsteen', Decimal('53'))]

In [ ]:
store_answer(3,4)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
6 rows affected.
guess: {"Artist":{"0":"The Beatles","1":"Bob Dylan","2":"The Rolling Stones","3":"David Bowie","4":"The Who","5":"Bruce Springsteen"},"purchases":{"0":93.0,"1":79.0,"2":64.0,"3":56.0,"4":54.0,"5":53.0}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
answer: {"Artist":{"0":"The Beatles","1":"Bob Dylan","2":"The Rolling Stones","3":"David Bowie","4":"The Who","5":"Bruce Springsteen"},"purchases":{"0":93.0,"1":79.0,"2":64.0,"3":56.0,"4":54.0,"5":53.0}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

## Problem 5

In what state has the most customers per capita?  If we define market penetration as the number of customers divided by the total population, what state has the highest market penetration?

You result set should have one row and two columns: `state` and `percentage`.  The `percentage` should be a number between 0 and 100.

Since we have so little data, the market penetrations will be tiny: always less than 1%, which means less that 1.

You'll need to relate states to their customers, which might be easiest with a join like the ones below.  Creep up on it.  Start with a simple query that does a join that seems right.  Then consider how you can modify that query incrementally to get where you want to go. You can of course make a sequences of Colab cells, each one with a variation on the one before.  Then execute `store_answer` after you thing you've got the answer.

Hint: You might want a `WHERE` clause that excludes those customers with no state.

In [ ]:
%%sql
select *
from states
limit 2;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
2 rows affected.

[('AK', 735132.0), ('AL', 4833722.0)]

In [ ]:
%%sql
select *
from customers
limit 2

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
2 rows affected.

[(1, 'Unpredisposing', 'Damnous', 'MA', None),
 (3, 'Inlayer', 'Anaschistic', 'CA', None)]

In [ ]:
%%sql
SELECT c.state,
       COUNT(DISTINCT c.cid) * 100.0 /(s.population) AS percentage
FROM customers AS c
INNER JOIN states AS s
ON c.state = s.state
WHERE c.state IS NOT NULL
GROUP BY c.state
ORDER BY percentage DESC
LIMIT 1;

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

[('WV', 0.00016178576975512106)]

In [ ]:
store_answer(3,5)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
guess: {"state":{"0":"WV"},"percentage":{"0":0.0001617858}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
answer: {"state":{"0":"WV"},"percentage":{"0":0.0001617858}}
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.

## Grade

In [ ]:
grade(3)

 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
correct: 5
 * mysql+pymysql://iv3848:***@mkt182.cluster-c58qrw93zbgu.us-east-1.rds.amazonaws.com/shared
1 rows affected.
total: 5

1.0

# Addendum

Here's an example of a recursive self-join, which is a little exotic but sometimes very useful.  These sorts of queries are common in graph-like data.

There are some specialized graph databases; however, some SQL databases can handle some graph and and associated queries to varying extents.

We'll just use SQLite for this quick example.

In [ ]:
%sql sqlite://

First we'll create a table of people, which will contain person-parent relationships.

We'll use this odd variation of a "table expression" to provide the table's rows explicitly.

Note that we're _creating_ a table here from a `SELECT` statement. This table has two columns: `person` and `parent`. The types are just integers, so imagine these numbers are just ids.

In [ ]:
%%sql
CREATE TABLE people AS
SELECT column1 AS person, column2 AS parent
  FROM (VALUES (1,2),
               (2,3),
               (3,4),
               (3,5),
               (10,11),
               (10,12),
               (12,13),
               (13,14))

Here's an example recursive self-join that shows the known ancestors of person 1.

The `||` are just string concatenations.

Note that common table expression (`parents`) is written in terms of itself.  That's the "recursive" part.

The implicit join of the table `people` to itself (line 7) is the "self-join" part.

In [ ]:
%%sql
WITH RECURSIVE
  parents(person,parent,generation) AS (
     VALUES (NULL,1,0)
     UNION ALL
     SELECT people.person, people.parent, parents.generation+1
        FROM people, parents
     WHERE people.person=parents.parent
  )
  SELECT SUBSTR('------------------',1,generation*3) ||
         person || ", " ||
         parent || " (" ||
         generation || ")" AS rel
    FROM parents